In [21]:
# Ensure pandas is installed (you've confirmed it is already installed)
import pandas as pd
import numpy as np
# Reading the CSV file
data = pd.read_csv('sample.csv')
df=pd.DataFrame(data)
# Display the dataframe
df

  name  income
0    a  100000
1    b   80000
2    c   75000
3    d   85000
4    e   90000

In [23]:
meanincome=df['income'].mean()
meanincome

86000.0

In [25]:
df['income'][2]=np.NaN
df

C:\Users\DELL\AppData\Local\Temp\ipykernel_7188\238163948.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][2]=np.NaN

  name    income
0    a  100000.0
1    b   80000.0
2    c       NaN
3    d   85000.0
4    e   90000.0

In [27]:
newdf=df.fillna(df.income.mean())
newdf

  name    income
0    a  100000.0
1    b   80000.0
2    c   88750.0
3    d   85000.0
4    e   90000.0